In [1]:
library(tidyverse)
employees <- read_csv("_build/data/employee_data.csv")
employees$Salary <- parse_number(employees$Salary)
employees$Start_Date <- parse_date(employees$Start_Date, format = "%m/%d/%Y")

Registered S3 methods overwritten by 'ggplot2':
  method         from
  [.quosures     rlang
  c.quosures     rlang
  print.quosures rlang

Registered S3 method overwritten by 'rvest':
  method            from
  read_xml.response xml2

-- Attaching packages --------------------------------------- tidyverse 1.2.1 --

v ggplot2 3.1.1       v purrr   0.3.2
v tibble  2.1.1       v dplyr   0.8.0.1
v tidyr   0.8.3       v stringr 1.4.0
v readr   1.3.1       v forcats 0.4.0

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

Parsed with column specification:
cols(
  ID = col_double(),
  Name = col_character(),
  Gender = col_character(),
  Age = col_double(),
  Rating = col_double(),
  Degree = col_character(),
  Start_Date = col_character(),
  Retired = col_logical(),
  Division = col_character(),
  Salary = col_character()
)

# Selecting Columns

In the previous section we saw how to select certain *rows* based on a set of conditions. In this section we show how to select certain *columns*, which we can do with `select()`: 

```{admonition} Syntax
`tidyverse::select(df, var1, var2, var3, ...)`
+ *Required arguments*
  - `df`: The tibble (data frame) with the data. 
  - `var1`: The name of the column to keep.
+ *Optional arguments*
  - `var2, var3, ...`: The name of additional columns to keep.
```

Imagine we wanted to explore the relationship between `Degree`, `Division`, and `Salary`, and did not care about any of the other columns in the employees data set. Using `select()`, we could create a new data frame with only those columns:

In [2]:
employeesTargetCols <- select(employees, Degree, Division, Salary)
head(employeesTargetCols)

  Degree      Division    Salary
1 High School Operations  108804
2 Ph.D        Engineering 182343
3 Master's    Engineering 206770
4 High School Sales       183407
5 Ph.D        Corporate   236240
6 Associate's Sales           NA

If we want to exclude column(s) by name, we can simply add a minus sign in front of the column names in the call to `filter()`:

In [3]:
employeesExcludedCols <- select(employees, -Age, -Retired)
head(employeesExcludedCols)

  ID   Name                Gender Rating Degree      Start_Date Division
1 6881 al-Rahimi, Tayyiba  Female 10     High School 1990-02-23 Operations
2 2671 Lewis, Austin       Male    4     Ph.D        2007-02-23 Engineering
3 8925 el-Jaffer, Manaal   Female 10     Master's    1991-02-23 Engineering
4 2769 Soto, Michael       Male   10     High School 1987-02-23 Sales
5 2658 al-Ebrahimi, Mamoon Male    8     Ph.D        1985-02-23 Corporate
6 1933 Medina, Brandy      Female  7     Associate's 1979-02-23 Sales
  Salary
1 108804
2 182343
3 206770
4 183407
5 236240
6     NA